qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F0/stm32f0xx_hal_rcc_ex.h
#define RCC_MCOSOURCE_PLLCLK_NODIV       (RCC_CFGR_MCO_PLL | RCC_CFGR_PLLNODIV)

#define IS_RCC_MCOSOURCE(SOURCE)  (((SOURCE) == RCC_MCOSOURCE_NONE)         || \
                                   ((SOURCE) == RCC_MCOSOURCE_LSI)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_LSE)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_SYSCLK)       || \
                                   ((SOURCE) == RCC_MCOSOURCE_HSI)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_HSE)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_PLLCLK_NODIV) || \
                                   ((SOURCE) == RCC_MCOSOURCE_PLLCLK_DIV2)  || \
                                   ((SOURCE) == RCC_MCOSOURCE_HSI14))

#endif /* STM32F030x6 || STM32F031x6 || STM32F038xx || STM32F070x6 || STM32F070xB || STM32F030xC */

#if defined(STM32F030x8) || defined(STM32F051x8) || defined(STM32F058xx)

#define IS_RCC_MCOSOURCE(SOURCE)  (((SOURCE) == RCC_MCOSOURCE_NONE)         || \
                                   ((SOURCE) == RCC_MCOSOURCE_LSI)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_LSE)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_SYSCLK)       || \
                                   ((SOURCE) == RCC_MCOSOURCE_HSI)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_HSE)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_PLLCLK_DIV2)  || \
                                   ((SOURCE) == RCC_MCOSOURCE_HSI14))

#endif /* STM32F030x8 || STM32F051x8 || STM32F058xx */

#if defined(STM32F042x6) || defined(STM32F048xx) || \
    defined(STM32F071xB) || defined(STM32F072xB) || defined(STM32F078xx) || \
    defined(STM32F091xC) || defined(STM32F098xx)

#define RCC_MCOSOURCE_HSI48              RCC_CFGR_MCO_HSI48
#define RCC_MCOSOURCE_PLLCLK_NODIV       (RCC_CFGR_MCO_PLL | RCC_CFGR_PLLNODIV)

#define IS_RCC_MCOSOURCE(SOURCE)  (((SOURCE) == RCC_MCOSOURCE_NONE)         || \
                                   ((SOURCE) == RCC_MCOSOURCE_LSI)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_LSE)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_SYSCLK)       || \
                                   ((SOURCE) == RCC_MCOSOURCE_HSI)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_HSE)          || \
                                   ((SOURCE) == RCC_MCOSOURCE_PLLCLK_NODIV) || \
                                   ((SOURCE) == RCC_MCOSOURCE_PLLCLK_DIV2)  || \
                                   ((SOURCE) == RCC_MCOSOURCE_HSI14)        || \
                                   ((SOURCE) == RCC_MCOSOURCE_HSI48))

#define RCC_IT_HSI48                     ((uint8_t)0x40)

/* Flags in the CR2 register */
#define RCC_CR2_HSI48RDY_BitNumber       16

#define RCC_FLAG_HSI48RDY                ((uint8_t)((CR2_REG_INDEX << 5) | RCC_CR2_HSI48RDY_BitNumber))

#endif /* STM32F042x6 || STM32F048xx ||             */
       /* STM32F071xB || STM32F072xB || STM32F078xx || */
       /* STM32F091xC || STM32F098xx */
/**
  * @}
  */

#if defined(STM32F042x6) || defined(STM32F048xx) || defined(STM32F072xB) || defined(STM32F078xx)

/** @defgroup RCCEx_USB_Clock_Source RCCEx USB Clock Source
  * @{
  */
#define RCC_USBCLKSOURCE_HSI48           RCC_CFGR3_USBSW_HSI48
#define RCC_USBCLKSOURCE_PLLCLK          RCC_CFGR3_USBSW_PLLCLK

#define IS_RCC_USBCLKSOURCE(SOURCE)  (((SOURCE) == RCC_USBCLKSOURCE_HSI48) || \
                                      ((SOURCE) == RCC_USBCLKSOURCE_PLLCLK))
/**
  * @}
  */

#endif /* STM32F042x6 || STM32F048xx || STM32F072xB || STM32F078xx */

#if defined(STM32F070x6) || defined(STM32F070xB)

/** @defgroup RCCEx_USB_Clock_Source RCCEx USB Clock Source
  * @{
  */
#define RCC_USBCLKSOURCE_PLLCLK          RCC_CFGR3_USBSW_PLLCLK

#define IS_RCC_USBCLKSOURCE(SOURCE)  (((SOURCE) == RCC_USBCLKSOURCE_PLLCLK))
/**
  * @}
  */

#endif /* STM32F070x6 || STM32F070xB */

#if defined(STM32F071xB) || defined(STM32F072xB) || defined(STM32F078xx) || \
    defined(STM32F091xC) || defined(STM32F098xx)

/** @defgroup RCCEx_USART2_Clock_Source RCCEx USART2 Clock Source
  * @{
  */
#define RCC_USART2CLKSOURCE_PCLK1        RCC_CFGR3_USART2SW_PCLK
#define RCC_USART2CLKSOURCE_SYSCLK       RCC_CFGR3_USART2SW_SYSCLK
#define RCC_USART2CLKSOURCE_LSE          RCC_CFGR3_USART2SW_LSE
#define RCC_USART2CLKSOURCE_HSI          RCC_CFGR3_USART2SW_HSI

#define IS_RCC_USART2CLKSOURCE(SOURCE)  (((SOURCE) == RCC_USART2CLKSOURCE_PCLK1)  || \
                                         ((SOURCE) == RCC_USART2CLKSOURCE_SYSCLK) || \
                                         ((SOURCE) == RCC_USART2CLKSOURCE_LSE)    || \
                                         ((SOURCE) == RCC_USART2CLKSOURCE_HSI))
/**
  * @}
  */

#endif /* STM32F071xB || STM32F072xB || STM32F078xx || */
       /* STM32F091xC || STM32F098xx */

#if defined(STM32F091xC) || defined(STM32F098xx)

/** @defgroup RCCEx_USART3_Clock_Source RCCEx USART3 Clock Source
  * @{
  */
#define RCC_USART3CLKSOURCE_PCLK1        RCC_CFGR3_USART3SW_PCLK
#define RCC_USART3CLKSOURCE_SYSCLK       RCC_CFGR3_USART3SW_SYSCLK
#define RCC_USART3CLKSOURCE_LSE          RCC_CFGR3_USART3SW_LSE
#define RCC_USART3CLKSOURCE_HSI          RCC_CFGR3_USART3SW_HSI

#define IS_RCC_USART3CLKSOURCE(SOURCE)  (((SOURCE) == RCC_USART3CLKSOURCE_PCLK1)  || \
                                         ((SOURCE) == RCC_USART3CLKSOURCE_SYSCLK) || \
                                         ((SOURCE) == RCC_USART3CLKSOURCE_LSE)    || \
                                         ((SOURCE) == RCC_USART3CLKSOURCE_HSI))
/**
  * @}
  */

#endif /* STM32F091xC || STM32F098xx */


#if defined(STM32F042x6) || defined(STM32F048xx) ||                         \
    defined(STM32F051x8) || defined(STM32F058xx) ||                         \
    defined(STM32F071xB) || defined(STM32F072xB) || defined(STM32F078xx) || \
    defined(STM32F091xC) || defined(STM32F098xx)

